export default {
  projections: {
    РасчетВремениE: {
      дата: {
        __caption__: 'Дата'
      },
      договор: {
        __caption__: 'Номер договора',
        статус: {
          __caption__: 'Статус'
        },
        длительность: {
          __caption__: 'Длительность'
        },
        едВремени: {
          __caption__: 'Единица времени'
        }
      },
      использовано: {
        __caption__: 'Использовано'
      },
      доступно: {
        __caption__: 'Доступно'
      },
      оказаниеУслуг: {
        __caption__: 'Оказание услуг',
        дата: {
          __caption__: 'Дата'
        },
        услуги: {
          __caption__: 'Наименование услуги',
          затрВремя: {
            __caption__: 'Затраченное время'
          },
          едВремени: {
            __caption__: 'Единица времени'
          }
        }
      }
    },
    РасчетВремениL: {
      дата: {
        __caption__: 'Дата'
      },
      договор: {
        __caption__: 'Номер договора',
        статус: {
          __caption__: 'Статус'
        },
        длительность: {
          __caption__: 'Длительность'
        },
        едВремени: {
          __caption__: 'Единица времени'
        }
      },
      использовано: {
        __caption__: 'Использовано'
      },
      доступно: {
        __caption__: 'Доступно'
      }
    },
    РасчетОстВремE: {
      дата: {
        __caption__: 'Дата'
      },
      договор: {
        __caption__: 'Номер договора',
        статус: {
          __caption__: 'Статус'
        },
        длительность: {
          __caption__: 'Длительность'
        },
        едВремени: {
          __caption__: 'Единица времени'
        }
      },
      использовано: {
        __caption__: 'Использовано'
      },
      доступно: {
        __caption__: 'Доступно'
      },
      оказаниеУслуг: {
        __caption__: 'Оказание услуг',
        дата: {
          __caption__: 'Дата'
        },
        услуги: {
          __caption__: 'Наименование услуги',
          затрВремя: {
            __caption__: 'Затраченное время'
          },
          едВремени: {
            __caption__: 'Единица времени'
          }
        }
      }
    },
    РасчетОстВремL: {
      дата: {
        __caption__: 'Дата'
      },
      договор: {
        __caption__: 'Номер договора',
        статус: {
          __caption__: 'Статус'
        },
        длительность: {
          __caption__: 'Длительность'
        },
        едВремени: {
          __caption__: 'Единица времени'
        }
      },
      использовано: {
        __caption__: 'Использовано'
      },
      доступно: {
        __caption__: 'Доступно'
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    доступно: {
      __caption__: 'Доступно'
    },
    использовано: {
      __caption__: 'Использовано'
    },
    договор: {
      __caption__: 'Номер договора'
    },
    оказаниеУслуг: {
      __caption__: 'Оказание услуг'
    }
  }
};
